In [7]:
#Загружаем и устанавливаем новую библиотеку в Python 
!pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.9-cp39-cp39-win_amd64.whl (1.2 MB)
     ---------------------------------------- 1.2/1.2 MB 2.2 MB/s eta 0:00:00
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.9

In [ ]:
'''
database="startml",
user="robot-startml-ro",
password="pheiph0hahj1Vaif",
host="postgres.lab.karpov.courses",
port=6432
'''

In [ ]:
import psycopg2
connection = psycopg2.connect(    # connection - это объект, который отвечает за соединение с БД
    database='exercises',         # database - это база данных (именно база, не СУБД)
    host='localhost',             # это говорит, что СУБД работает на моем компьютере
    user='postgres',              # имя пользователя
    password='password'           # пароль
    # port=5432,                  # порт не указываем, по умолчанию 5432
)
cursor = connection.cursor()      # cursor - это объект, который отвечает за взаимодействие с БД
# Делаем запрос
cursor.execute("""                   
SELECT *
FROM cd.bookings -- cd есть схема, bookings есть таблица
-- синтаксис "схема.таблица"
LIMIT 10
""")
results = cursor.fetchall()       # Получаем результаты (fetchall() - "получить всё")
results                           # Это будет стандартный Python-объект. Не очень удобно, но работает

In [1]:
#Подключаем библиотеку
import pandas as pd
#Узнаем версию библиотеки
print(pd.__version__)
con="postgresql://robot-startml-ro:pheiph0hahj1Vaif@postgres.lab.karpov.courses:6432/startml"

1.3.5

In [2]:
#Загрузка таблицы через pandas

df = pd.read_sql(
    """SELECT * FROM "feed_action" LIMIT 10 """,
    con="postgresql://robot-startml-ro:pheiph0hahj1Vaif@"
        "postgres.lab.karpov.courses:6432/startml"
)

df.head()

   user_id  post_id action                time
0    74755     5018   view 2021-12-29 17:13:48
1   164820     5099   view 2021-12-29 17:13:48
2   129349     5030   like 2021-12-29 17:13:48
3   158552     5062   view 2021-12-29 17:13:48
4    31984     5060   view 2021-12-29 17:13:48

In [3]:
#3. запрос на все колонки из таблицы user
con="postgresql://robot-startml-ro:pheiph0hahj1Vaif@postgres.lab.karpov.courses:6432/startml"
df_user = pd.read_sql(
'''SELECT * FROM "user" ''',
con
)
df_user.head()

    id  gender  age country               city  exp_group       os source
0  200       1   34  Russia          Degtyarsk          3  Android    ads
1  201       0   37  Russia             Abakan          0  Android    ads
2  202       1   17  Russia           Smolensk          4  Android    ads
3  203       0   18  Russia             Moscow          1      iOS    ads
4  204       0   36  Russia  Anzhero-Sudzhensk          3  Android    ads

In [18]:
#4. Отберите уникальные значения тем (topic) в таблице постов (post).
df_post = pd.read_sql(
'''SELECT distinct topic FROM "post" ''',
con
)
df_post.head()

(7, 1)

In [20]:
#5. Отберите пользователей старше 30 с устройством на iOS
df_user_2 = pd.read_sql(
'''SELECT * 
   FROM "user"
   WHERE age > 30 AND os= 'iOS'
   ORDER BY id''',
con
)
df_user_2.head()

    id  gender  age     country           city  exp_group   os source
0  212       1   47      Russia        Podolsk          0  iOS    ads
1  222       0   45      Russia      Ulyanovsk          0  iOS    ads
2  224       1   32      Russia  Yekaterinburg          2  iOS    ads
3  226       1   31      Russia         Moscow          4  iOS    ads
4  243       1   38  Kazakhstan      Ekibastuz          1  iOS    ads

In [21]:
#6. Отберите пользователей, которые не из России и при этом либо их экспериментальная группа не 0 и не 3 или их город – Минск
df_user_3 = pd.read_sql(
'''SELECT * 
   FROM "user"
   WHERE country != 'Russia' AND (exp_group not in (0, 3) OR city = 'Minsk')
''',
con
)
df_user_3.head()

    id  gender  age     country       city  exp_group       os source
0  211       1   22     Belarus      Minsk          0      iOS    ads
1  213       1   22     Ukraine  Kamianske          2      iOS    ads
2  216       0   38     Ukraine       Lviv          1  Android    ads
3  218       1   25     Belarus      Minsk          2      iOS    ads
4  228       0   17  Azerbaijan       Baku          2      iOS    ads

In [24]:
# 7. Подсчитайте средний возраст пользователей в разрезе страны.
df_user_4 = pd.read_sql(
'''SELECT country, avg(age) 
   FROM "user"
   GROUP BY country 
   order by 1
''',
con
)
df_user_4.head(10)

       country        avg
0   Azerbaijan  26.784695
1      Belarus  27.277255
2       Cyprus  28.070588
3      Estonia  28.146067
4      Finland  27.131957
5   Kazakhstan  27.224464
6       Latvia  27.217143
7       Russia  27.188387
8  Switzerland  27.950617
9       Turkey  27.452055

In [25]:
# 8. Подсчитайте средний возраст пользователей в разрезе страны.
df_user_5 = pd.read_sql(
'''SELECT exp_group, 
          os,
          count(id) total_users,
          max(age) max_age,
          min(age) min_age
   FROM "user"
   GROUP BY exp_group, 
          os 
   order by 1
''',
con
)
df_user_5.head(10)
#df_user_5.to_csv('task6_8.csv', sep = ',', index = False)

   exp_group       os  total_users  max_age  min_age
0          0  Android        21234       95       14
1          0      iOS        11489       79       14
2          1  Android        21232       92       14
3          1      iOS        11406       87       14
4          2  Android        21102       78       14
5          2      iOS        11512       74       14
6          3  Android        21319       84       14
7          3      iOS        11449       85       14
8          4  Android        21085       84       14
9          4      iOS        11377       78       14

In [32]:
# 9. В каждой категории постов определите длину самого длинного текста, используя таблицу post. 
#В ответ отправьте тему, у которой длина самого большого поста больше 25 000.
df_post_2 = pd.read_sql(
''' SELECT * 
    FROM "post"
    WHERE length(text)>25000''',
con
)
df_post_2.head()

     id                                               text     topic
0  1379  Terror powers expose tyranny\n\nThe Lord Chanc...  politics

In [38]:
# 10. Подсчитайте средний возраст пользователей в разрезе страны.
df_user_6 = pd.read_sql(
'''
WITH c_c as (SELECT country, count(*) qty
FROM "user"
GROUP BY country
HAVING count(*)>1000)
SELECT country, min(qty) 
FROM c_c
GROUP BY country
ORDER BY 2
''',
con
)
df_user_6.head(10)

      country     min
0  Azerbaijan    1542
1     Finland    1599
2      Turkey    1606
3  Kazakhstan    3172
4     Belarus    3293
5     Ukraine    8273
6      Russia  143035

In [40]:
# 12. Отберите для пользователей из Москвы экспериментальные группы, в которых средний возраст больше 27.2
df_user_7 = pd.read_sql(
'''
SELECT exp_group, count(*) qty
FROM "user"
WHERE city = 'Moscow'
GROUP BY exp_group
HAVING avg(age) > 27.2
''',
con
)
df_user_7.head(10)

   exp_group   qty
0          1  4414
1          3  4378

In [2]:
#13. Найдите в таблице post 3 темы с наибольшим количеством постов. Напишите через пробел названия этих тем.

df_post_3 = pd.read_sql(
''' 
SELECT topic, count(*) qty
FROM "post"
GROUP BY topic
ORDER BY 2 DESC
LIMIT 3
''',
con
)
df_post_3.head()

   topic   qty
0  movie  3000
1  covid  1799
2  sport   510

In [43]:
# 14. Отберите пользователей из Воронежа (Voronezh) и отсортируйте их по возрасту в убывающем порядке. 
#     Для равных возрастов отсортируйте по возрастанию экспериментальной группы.

df_user_8 = pd.read_sql(
'''
SELECT *
FROM "user"
WHERE city = 'Voronezh'
ORDER BY age DESC, exp_group

''',
con
)
df_user_8.head(10)

       id  gender  age country      city  exp_group       os   source
0   89990       0   71  Russia  Voronezh          0  Android      ads
1    2441       1   71  Russia  Voronezh          3  Android      ads
2   14184       1   66  Russia  Voronezh          3  Android      ads
3   35093       0   65  Russia  Voronezh          0  Android      ads
4   77284       0   64  Russia  Voronezh          4  Android      ads
5    6722       1   63  Russia  Voronezh          1      iOS      ads
6  109066       1   63  Russia  Voronezh          3      iOS  organic
7  114632       0   61  Russia  Voronezh          0  Android  organic
8  146021       1   61  Russia  Voronezh          1  Android  organic
9   41056       0   61  Russia  Voronezh          3      iOS      ads

In [51]:
# 15. Отберите post_id, time, age и os пользователя для всех лайков пользователей из Омска

df_2 = pd.read_sql(
'''
SELECT 
post_id,
time,
age,
os
FROM "user" u
JOIN feed_action fa ON u.id = fa.user_id
WHERE city = 'Omsk' AND action = 'like'
ORDER BY time DESC
LIMIT 100

''',
con
)
df_2.head(10)
#df_2.to_csv('ex_6_15.csv', index = False)

In [5]:
#16. Найдите город, пользователи которого в возрасте 36 лет 2021-12-01 числа просмотрели запись 
#    на тему covid меньше всего раз относительно других городов

df_3 = pd.read_sql(
'''
SELECT city, count(*) qty
FROM "user" u
JOIN feed_action fa ON u.id = fa.user_id
JOIN post p ON p.id = fa.post_id
WHERE age = 36 AND topic = 'covid' AND DATE(time) = '2021-12-01'
GROUP BY city
ORDER BY qty 
''',
con
)
df_3.head(10)

                 city  qty
0         Arkhangelsk    6
1            Fryazino    9
2          Apsheronsk   10
3               Lubny   10
4                Kirs   11
5            Mariinsk   11
6               Chita   12
7          Karmaskaly   12
8               Varna   12
9  Usol’ye-Sibirskoye   13

In [ ]:
#17. Напишите SQL запрос, используя который вы получите:
#  - топ N постов по лайкам,
#- количество пролайкавших пользователей,
#- время последнего лайка.

df_4 = pd.read_sql(
'''
SELECT post_id, time, count(*) qty
FROM "user" u
JOIN feed_action fa ON u.id = fa.user_id
JOIN post p ON p.id = fa.post_id
WHERE action = 'like'
GROUP BY post_id, time
ORDER BY qty desc, time desc 
''',
con
)
df_4.head(10)

In [3]:
#17. Напишите SQL запрос, используя который вы получите:
#  - топ N постов по лайкам,
#- количество пролайкавших пользователей,
#- время последнего лайка.

df_4 = pd.read_sql(
'''
SELECT post_id,  count(*) qty
FROM feed_action
WHERE action = 'like'
GROUP BY post_id
ORDER BY qty desc
Limit 10
''',
con
)
df_4.head(10)

   post_id    qty
0     4866  31714
1     5127  29637
2     6448  27939
3     6498  27729
4     6513  27686
5     3192  26507
6     6314  26478
7     6864  24156
8     5413  23441
9     5165  22596